  function [yd]=ydcaculate(TBP,tempoint)
%宽馏分收率计算

%切割方案1：新温度点：[65 80 100 120 140 155 165 170 200 220 235 240 260 280 300 320 350 360 365 380 400 425 450 470 500 520 540 545] 石脑油：IBP-170; 航煤：170-235;柴油：235-365;蜡油：365-545;
%切割方案2：新温度点：[65 80 100 120 140 155 165 170 184 194 200 220 240 260 280 300 320 350 365 380 400 425 450 470 500 520 540 545] 石脑油：IBP-170; 航煤：170-194;柴油：194-365;蜡油：365-545;
%切割方案3：新温度点：[65 80 100 120 140 155 165 180 184 200 220 235 240 260 280 300 320 350 360 365 380 400 425 450 470 500 520 540 545]  石脑油：IBP-184; 航煤：184-235;柴油：235-365;蜡油：365-545;
%切割方案4：新温度点：[65 80 100 120 140 155 165 170 180 200 220 235 240 260 280 300 320 350 360 380 400 425 450 470 500 520 540 545] 石脑油：IBP-170; 航煤：170-235;柴油：235-360;蜡油：360-545;
%切割方案5：新温度点：[65 80 100 120 140 165 180 194 200 220 240 260 280 300 320 350 360 380 400 425 450 470 500 520 540 545] 石脑油：IBP-170; 航煤：170-194;柴油：194-360;蜡油：360-545;
%切割方案6：新温度点：[65 80 100 120 140 165 180 184 200 220 235 240 260 280 300 320 350 360 380 400 425 450 470 500 520 540  540] 石脑油：IBP-184; 航煤：184-235;柴油：235-360;蜡油：360-545;
% 输入：TBP,快评用户平台得到的分段馏分收率，23个点，[65 80 100 120 140 165 180 200 220 240 260 280 300 320 350 380 400 425 450 470 500 520 540】
% tempoint，输入的切割方案，即温度点设置，从设置的对话框中读入，例子：切割范围对话框设置为【IBP-170；170-235；235-365；365-545】；
% 即读取每一个区间的第二个=【170 235 365 545】，将其插入标准温度点得到新的温度点进行重新切割。
% 设计可输入6套：即【170 235 365 545;170 194 365 545;184 235 365 545;170 235 360 545;170 194 360 545;184 235 360 545];    
% 确保切割范围的输入为一个连续区间，即不能输入170 160 365 545。
% 输出：yd，按照切割方案得到的宽馏分收率
%-------------------------------------------------------------------
 %将输入的TBP馏分段收率转化为累计收率
 TBP=TBP'; [m,n]=size(TBP);
 aTBP(1)=TBP(1);
 for i=2:n
     aTBP(i)=aTBP(i-1)+TBP(i);
 end
 aTBP
[m,n]=size(tempoint);%判断输入了几套切割方案
 yd=zeros(m,n); %六套方案，每一行对应每一套方案的各个宽馏分收率
 x=[65 80 100 120 140 165 180 200 220 240 260 280 300 320 350 380 400 425 450 470 500 520 540];%标准温度点
 for i=1:m
     xx=[x,tempoint(i,:)];
     xx=sort(xx);
     [m1,n1]=size(xx);
 %------------判断是否有重复温度点
 k=0;
 for ii=1:n1-1
a=xx(ii+1)-xx(ii);
if a==0
k=k+1;
ad(k)=ii;
end
 end
 if k>0
xx(ad)=[];
 end
%-----------------------------------------------------
 % 第1套切割
 %xx=[65 80 100 120 140 155 165 184 200 220 240 260 280 300 320 350 360 380 400 425 450 470 500 520 545];% 石脑油65-155; 航煤155-184;柴油184-360;蜡油360-545;
 kk=spline(x,aTBP,xx); %按照新温度点得到的累计馏分收率
for j=1:n
    ad(j)=find(xx==tempoint(i,j));
end
 yd(i,1)=kk(ad(1));
 yd(i,2)=kk(ad(2))-kk(ad(1));
 yd(i,3)=kk(ad(3))-kk(ad(2));
 yd(i,4)=kk(ad(4))-kk(ad(3)); % 计算宽馏分收率
 end
 yd=(round(yd*100))/100;